In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series([1,3,5,np.nan,6,8,"a"])
s
#Series는 python의 기초 데이터 유형임.내부 타입은 가변적, 복합적으로 넣었을 경우 object 타입 리턴

0      1
1      3
2      5
3    NaN
4      6
5      8
6      a
dtype: object

In [3]:
dates = pd.date_range('20130101', periods=6)
dates
#기본형 date 타입

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=['A','B','C','D'])
df
#6행 4열의 랜덤 변수를 프레임에 넣는데 인덱스는 dates고 컬럼은 abcd로..
#선언한 데이터프레임과 다를 경우 Shape of passed values is (5, 6), indices imply (4, 6) 에러가 발생

                   A         B         C         D
2013-01-01  0.421711 -0.637384  1.299916  0.085104
2013-01-02  2.272626  0.029670 -2.455052  0.145952
2013-01-03 -0.996163 -0.513563 -0.714785  0.813898
2013-01-04 -0.395034 -1.672342  1.648827 -0.223355
2013-01-05 -1.189048  1.112350 -0.501982  0.731633
2013-01-06  0.243477 -0.121769  1.812386  0.221748

In [5]:
#df.index
new_dates = df.index
new_dates
#dates 타입으로 리턴이 됨

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df.columns
#columns는 index가 리턴됨
a = df.columns
print(a[0])
print(type(a))

A
<class 'pandas.core.indexes.base.Index'>

In [7]:
df.info() #정보를 출력함

df['20130102':'20130104']
df[dates[0]:dates[1]]
#오로지 date 타입만 가능함

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
A    6 non-null float64
B    6 non-null float64
C    6 non-null float64
D    6 non-null float64
dtypes: float64(4)
memory usage: 240.0 bytes

                   A         B         C         D
2013-01-01  0.421711 -0.637384  1.299916  0.085104
2013-01-02  2.272626  0.029670 -2.455052  0.145952

In [8]:
print(df.loc[dates[0]])
#인덱스인 날짜를 기준으로 슬라이싱

print(df.loc[:,['A','B']])
#모든날짜의 특정 칼럼만 슬라이싱

print(df.loc[dates[0]:dates[1],["A","B"]])
#특정 날짜의 특정 칼럼만 슬라이싱

A    0.421711
B   -0.637384
C    1.299916
D    0.085104
Name: 2013-01-01 00:00:00, dtype: float64
                   A         B
2013-01-01  0.421711 -0.637384
2013-01-02  2.272626  0.029670
2013-01-03 -0.996163 -0.513563
2013-01-04 -0.395034 -1.672342
2013-01-05 -1.189048  1.112350
2013-01-06  0.243477 -0.121769
                   A         B
2013-01-01  0.421711 -0.637384
2013-01-02  2.272626  0.029670

In [9]:
df.iloc[3]
#loc에서 특정 날짜를 직접 입력하지 않고 index로 슬라이싱

A   -0.395034
B   -1.672342
C    1.648827
D   -0.223355
Name: 2013-01-04 00:00:00, dtype: float64

In [10]:
print(df.iloc[3:5,0:2]) # 범위로 슬라이싱
print(df.iloc[[1,2,4],[0,2]]) # 특정 데이터만 슬라이싱(콤마)

                   A         B
2013-01-04 -0.395034 -1.672342
2013-01-05 -1.189048  1.112350
                   A         C
2013-01-02  2.272626 -2.455052
2013-01-03 -0.996163 -0.714785
2013-01-05 -1.189048 -0.501982

In [11]:
df[df.A > 0]
df[df>0] #만족하지 않는 컬럼은 NaN

                   A        B         C         D
2013-01-01  0.421711      NaN  1.299916  0.085104
2013-01-02  2.272626  0.02967       NaN  0.145952
2013-01-03       NaN      NaN       NaN  0.813898
2013-01-04       NaN      NaN  1.648827       NaN
2013-01-05       NaN  1.11235       NaN  0.731633
2013-01-06  0.243477      NaN  1.812386  0.221748

In [13]:
#그냥 =  를 활용해서 복사하면 데이터 위치만 (주소만 참조) 복사가 되므로 실제 데이터를 변경하려면 copy를 사용하면 된다.
df2 = df.copy()
df2['E'] = ['one', 'one','two','three','four','three'] #행 추가
df2

                   A         B         C         D      E
2013-01-01  0.421711 -0.637384  1.299916  0.085104    one
2013-01-02  2.272626  0.029670 -2.455052  0.145952    one
2013-01-03 -0.996163 -0.513563 -0.714785  0.813898    two
2013-01-04 -0.395034 -1.672342  1.648827 -0.223355  three
2013-01-05 -1.189048  1.112350 -0.501982  0.731633   four
2013-01-06  0.243477 -0.121769  1.812386  0.221748  three

In [22]:
df2['E'].isin(['two','four'])
#특정 데이터의 포함조건은 isin 명령 활용 yes or no 로 표시가 됨
df2[df2['E'].isin(['two','four'])]
#포함조건이 true인 데이터만 출력 하고 싶을 때
df2

                   A         B         C         D      E
2013-01-01  0.421711 -0.637384  1.299916  0.085104    one
2013-01-02  2.272626  0.029670 -2.455052  0.145952    one
2013-01-03 -0.996163 -0.513563 -0.714785  0.813898    two
2013-01-04 -0.395034 -1.672342  1.648827 -0.223355  three
2013-01-05 -1.189048  1.112350 -0.501982  0.731633   four
2013-01-06  0.243477 -0.121769  1.812386  0.221748  three

In [27]:
df.apply(np.cumsum)
#np.cumsum은 내려가면서 각 데이터들을 순차적으로 합산해서 표시함. 
df.apply(lambda x: x.max() - x.min()) #람다 사용 가능

A    3.461673
B    2.784691
C    4.267437
D    1.037253
dtype: float64